[
  {
    "id": "capital-group-unveils-advisor-benchmark-service-to-enhance-practice-management-offerings",
    "title": "Capital Group Unveils Advisor Benchmark Service to Enhance Practice Management Offerings",
    "published_date": "October 3, 2023",
    "url": "https://www.capitalgroup.com/advisor/pro/pathways-to-growth/your-growth-plan",
    "summary": "Capital Group has launched \"Your Growth Plan,\" a new advisor benchmark service designed to help financial professionals grow their business and deliver more value to clients. The service leverages insights from Capital Group's multiyear national advisor Pathways to Growth study and provides financial professionals with a downloadable 20-page personalized report with strategies to help leverage key growth drivers. The report includes strengths and areas of opportunity based on survey responses.",
    "tags": [
      "advisor",
      "benchmark",
      "capital",
      "enhance",
      "group",
      "management",
      "offerings",
      "practice",
      "service",
      "unveils"
    ]
  },
  {
    "id": "traits-of-top-advisors-in-2024",
    "title": "Traits of Top Advisors in 2024",
    "published_date": "2024",
    "url": "https://www.capitalgroup.com/advisor/practicelab/webinars/traits-of-top-advisors.html",
    "summary": "Capital Group's multiyear proprietary study of nearly 3,000 advisors identifies the key traits that helped top advisors more effectively engage new clients, add value to current relationships and lead teams optimized for growth. The study reveals traits top advisors share, with Capital Group's Content Director, Wealth Strategist, and Head of Customer Research and Insights offering insight on how to apply those skills in practice.",
    "tags": [
      "2024",
      "advisors",
      "traits"
    ]
  },
  {
    "id": "advisor-productivity-a-key-to-unlock-business-growth",
    "title": "Advisor Productivity: A Key to Unlock Business Growth",
    "published_date": "2024",
    "url": "https://www.capitalgroup.com/advisor/practicelab/articles/how-to-improve-productivity.html",
    "summary": "Capital Group research reveals that advisor productivity is crucial for unlocking business growth. The study shows that practices focusing on efficiency through technology, model portfolios, and standardized processes achieve significantly higher growth rates. Top-performing advisors leverage productivity tools and team building to create scalable practices that can serve more clients effectively while maintaining high service standards.",
    "tags": [
      "CRM",
      "advisor",
      "business",
      "growth",
      "productivity",
      "unlock"
    ]
  },
  {
    "id": "3-client-acquisition-strategies-from-an-advisor-and-wilderness-survival-expert",
    "title": "3 Client Acquisition Strategies from an Advisor and Wilderness Survival Expert",
    "published_date": "2024",
    "url": "https://www.capitalgroup.com/advisor/practicelab/articles/client-acquisition-strategies-for-financial-advisors.html",
    "summary": "Drawing parallels between wilderness survival and building a successful advisory practice, this article explores three proven client acquisition strategies. The first strategy focuses on preparation and planning, emphasizing the importance of having a clear target market and value proposition. Just as survival experts prepare for various scenarios, successful advisors develop multiple client acquisition channels.",
    "tags": [
      "acquisition",
      "advisor",
      "client",
      "expert",
      "from",
      "strategies",
      "survival",
      "wilderness"
    ]
  },
  {
    "id": "pathways-to-growth-capital-group-s-2024-advisor-benchmark-study",
    "title": "Pathways to Growth: Capital Group's 2024 Advisor Benchmark Study",
    "published_date": "2024",
    "url": "https://www.capitalgroup.com/advisor/pro/pathways-to-growth.html",
    "summary": "The comprehensive Pathways to Growth study collected responses from approximately 1,500 financial professionals to study the range of behaviors and attitudes that advisors deemed to be most important. The highest growth advisors are much more likely to employ an active and repeatable process to acquire new clients, though referrals remain the leading source, accounting for nearly 85% of new clients.",
    "tags": [
      "2024",
      "advisor",
      "benchmark",
      "capital",
      "group",
      "growth",
      "pathways",
      "study"
    ]
  },
  {
    "id": "practicelab-your-digital-destination-for-practice-management",
    "title": "PracticeLab: Your Digital Destination for Practice Management",
    "published_date": "2023",
    "url": "https://www.capitalgroup.com/advisor/ca/en/practicelab.html",
    "summary": "PracticeLab is Capital Group's digital destination offering practice management ideas and insights for financial advisors looking to grow their business and better serve investor clients. The platform features a podcast where experienced financial professionals share success stories and practical strategies for practice growth.",
    "tags": [
      "destination",
      "digital",
      "management",
      "practice",
      "practicelab",
      "your"
    ]
  },
  {
    "id": "the-power-of-standard-operating-procedures-in-advisory-practices",
    "title": "The Power of Standard Operating Procedures in Advisory Practices",
    "published_date": "2024",
    "url": "https://www.capitalgroup.com/ria/insights/articles/make-client-onboarding-repeatable-and-referral-generating.html",
    "summary": "More than 60% of the highest growth practices have standard operating procedures (SOPs) in place for critical activities like client onboarding, annual reviews, and portfolio rebalancing. These SOPs enable practices to deliver consistent, high-quality service while improving efficiency and reducing errors. By documenting processes, firms can more easily train new team members and ensure continuity of service.",
    "tags": [
      "advisory",
      "operating",
      "power",
      "practices",
      "procedures",
      "standard"
    ]
  },
  {
    "id": "technology-adoption-the-differentiator-for-high-growth-practices",
    "title": "Technology Adoption: The Differentiator for High-Growth Practices",
    "published_date": "2024",
    "url": "https://www.capitalgroup.com/advisor/insights/categories/practice-management.html",
    "summary": "High-growth advisors were significantly more likely to rely on technologies to help optimize workflow processes. The research shows that technology adoption goes beyond just having the tools – it's about integrating them effectively into daily operations. Successful advisors use technology to automate routine tasks, improve client communication, and provide better insights through data analytics.",
    "tags": [
      "CRM",
      "adoption",
      "differentiator",
      "growth",
      "high",
      "practices",
      "technology"
    ]
  },
  {
    "id": "building-high-performance-advisory-teams",
    "title": "Building High-Performance Advisory Teams",
    "published_date": "2023",
    "url": "https://www.capitalgroup.com/ria/insights/articles/team-performance-through-employee-engagement.html",
    "summary": "Team building is identified as one of the key drivers leading to higher growth practices. The research reveals that successful advisors focus on creating diverse teams with complementary skills, clear roles and responsibilities, and strong communication protocols. High-growth practices invest in continuous training and development, ensuring team members stay current with industry trends and best practices.",
    "tags": [
      "advisory",
      "building",
      "high",
      "performance",
      "teams"
    ]
  },
  {
    "id": "model-portfolios-streamlining-investment-management-for-growth",
    "title": "Model Portfolios: Streamlining Investment Management for Growth",
    "published_date": "2024",
    "url": "https://www.capitalgroup.com/advisor/practicelab/articles/model-portfolio-benefits.html",
    "summary": "The use of model portfolios is identified as a key efficiency driver for high-growth practices. By standardizing investment approaches through models, advisors can serve more clients while maintaining consistent quality and reducing operational complexity. Model portfolios enable advisors to spend less time on portfolio construction and more time on client relationships and financial planning.",
    "tags": [
      "growth",
      "investment",
      "management",
      "model",
      "portfolios",
      "streamlining"
    ]
  },
  {
    "id": "the-value-of-comprehensive-financial-planning",
    "title": "The Value of Comprehensive Financial Planning",
    "published_date": "2024",
    "url": "https://www.capitalgroup.com/advisor/ca/en/practicelab/articles/9-benefits-goals-based-planning.html",
    "summary": "Practices offering comprehensive financial planning services beyond investment management experience faster growth rates. The research indicates that clients increasingly seek holistic advice covering all aspects of their financial lives, including retirement planning, tax strategies, estate planning, and risk management. Advisors who position themselves as comprehensive wealth managers rather than investment managers command higher fees and deeper client relationships.",
    "tags": [
      "comprehensive",
      "financial",
      "planning",
      "value"
    ]
  },
  {
    "id": "marketing-strategies-for-modern-advisory-practices",
    "title": "Marketing Strategies for Modern Advisory Practices",
    "published_date": "2023",
    "url": "https://www.capitalgroup.com/advisor/practicelab/articles/digital-marketing-financial-advisors.html",
    "summary": "While referrals remain the dominant source of new clients, practices that implement proactive marketing strategies achieve above-average growth rates. The research identifies key marketing tactics including content marketing, social media engagement, educational seminars, and strategic partnerships. Successful advisors develop a consistent brand message and maintain regular communication with both clients and prospects.",
    "tags": [
      "advisory",
      "marketing",
      "modern",
      "practices",
      "strategies"
    ]
  },
  {
    "id": "client-segmentation-the-foundation-of-efficient-service-delivery",
    "title": "Client Segmentation: The Foundation of Efficient Service Delivery",
    "published_date": "2024",
    "url": "https://www.capitalgroup.com/advisor/practicelab/articles/define-your-ideal-client.html",
    "summary": "High-growth practices implement clear client segmentation strategies that align service levels with client value and needs. The research shows that segmentation enables advisors to allocate resources more effectively, provide appropriate service to all clients, and identify growth opportunities within their existing client base. Successful practices typically use multiple criteria for segmentation including assets, revenue, complexity, and growth potential.",
    "tags": [
      "client",
      "delivery",
      "efficient",
      "foundation",
      "segmentation",
      "service"
    ]
  },
  {
    "id": "the-importance-of-client-experience-in-practice-growth",
    "title": "The Importance of Client Experience in Practice Growth",
    "published_date": "2023",
    "url": "https://www.capitalgroup.com/advisor/ca/en/practicelab/categories/client-experience.html",
    "summary": "Creating exceptional client experiences is identified as a critical differentiator for high-growth practices. The research shows that client experience encompasses every interaction from initial contact through ongoing service, and successful advisors intentionally design and manage these touchpoints. Key elements include responsive communication, proactive outreach, personalized service, and consistent follow-through.",
    "tags": [
      "client",
      "experience",
      "growth",
      "importance",
      "practice"
    ]
  },
  {
    "id": "succession-planning-protecting-and-enhancing-practice-value",
    "title": "Succession Planning: Protecting and Enhancing Practice Value",
    "published_date": "2024",
    "url": "https://www.capitalgroup.com/advisor/practicelab/articles/successful-succession-planning-for-financial-advisors.html",
    "summary": "The research reveals that practices with formal succession plans not only protect their value but also position themselves for accelerated growth. Succession planning forces advisors to document processes, build strong teams, and create practices that can operate independently of the founder. This systematization directly contributes to current growth while ensuring long-term sustainability.",
    "tags": [
      "enhancing",
      "planning",
      "practice",
      "protecting",
      "succession",
      "value"
    ]
  },
  {
    "id": "generational-wealth-transfer-a-growth-opportunity-for-advisors",
    "title": "Generational Wealth Transfer: A Growth Opportunity for Advisors",
    "published_date": "2023",
    "url": "https://www.capitalgroup.com/advisor/practicelab/articles/wealth-planning-life-events.html",
    "summary": "With the largest intergenerational wealth transfer in history underway, practices that effectively serve multiple generations within families experience superior growth. The research shows that advisors who build relationships with clients' children and grandchildren retain significantly more assets during wealth transfer events. Successful practices implement specific strategies for engaging younger family members, including education programs and gradual relationship building.",
    "tags": [
      "advisors",
      "generational",
      "growth",
      "opportunity",
      "transfer",
      "wealth"
    ]
  },
  {
    "id": "the-role-of-professional-development-in-practice-growth",
    "title": "The Role of Professional Development in Practice Growth",
    "published_date": "2024",
    "url": "https://www.capitalgroup.com/advisor/pro/courses.html",
    "summary": "Continuous professional development emerges as a key characteristic of high-growth practices. The research shows that successful advisors invest in ongoing education not just for compliance but to expand capabilities, stay current with industry trends, and differentiate their services. This includes pursuing advanced credentials, attending conferences, and participating in study groups or mastermind programs.",
    "tags": [
      "development",
      "growth",
      "practice",
      "professional",
      "role"
    ]
  },
  {
    "id": "pricing-strategies-for-advisory-services",
    "title": "Pricing Strategies for Advisory Services",
    "published_date": "2023",
    "url": "https://www.capitalgroup.com/advisor/investments/share-class-information/share-class-pricing.html",
    "summary": "The research identifies pricing strategy as a critical but often overlooked driver of practice growth. High-growth practices regularly review and adjust their pricing to reflect the value delivered, market conditions, and practice objectives. The study shows that successful advisors move beyond asset-based fees alone, incorporating planning fees, retainers, and project-based pricing to better align compensation with services provided.",
    "tags": [
      "advisory",
      "pricing",
      "services",
      "strategies"
    ]
  },
  {
    "id": "compliance-and-risk-management-as-growth-enablers",
    "title": "Compliance and Risk Management as Growth Enablers",
    "published_date": "2024",
    "url": "https://www.capitalgroup.com/ria/insights/articles/cybersecurity-basics-for-financial-advisors.html",
    "summary": "Rather than viewing compliance as a burden, high-growth practices leverage strong compliance and risk management programs as competitive advantages. The research shows that robust compliance infrastructure enables practices to confidently pursue growth opportunities, expand services, and build client trust. Successful advisors integrate compliance into their operations seamlessly rather than treating it as a separate function.",
    "tags": [
      "compliance",
      "enablers",
      "growth",
      "management",
      "risk"
    ]
  },
  {
    "id": "your-growth-plan-personalized-insights-for-practice-success",
    "title": "Your Growth Plan: Personalized Insights for Practice Success",
    "published_date": "October 2023",
    "url": "https://www.capitalgroup.com/advisor/pro/pathways-to-growth/your-growth-plan",
    "summary": "Capital Group's Your Growth Plan service represents a new approach to practice management support, providing personalized insights based on individual practice characteristics and goals. The service analyzes responses across multiple dimensions of practice management, comparing them to successful peers and identifying specific opportunities for improvement. Each 20-page report includes actionable strategies tailored to the advisor's current situation and growth objectives.",
    "tags": [
      "growth",
      "insights",
      "personalized",
      "plan",
      "practice",
      "success",
      "your"
    ]
  },
  {
    "id": "cgmm-capital-group-u-s-small-and-mid-cap-etf-focused-growth-in-the-smid-space",
    "title": "CGMM — Capital Group U.S. Small and Mid Cap ETF: Focused Growth in the SMID Space",
    "published_date": "2024",
    "url": "https://www.capitalgroup.com/advisor/investments/exchange-traded-funds/details/cgmm",
    "summary": "CGMM is an actively managed equity ETF seeking long-term capital appreciation by investing primarily in U.S. small- and mid-cap companies. The strategy concentrates on durable growers and quality cyclicals within the SMID universe, using multi-manager research to balance upside potential with risk awareness. For advisors building satellite exposures around a core U.S. equity allocation, CGMM can complement large-cap holdings and broaden factor diversification while keeping the portfolio squarely in domestic stocks.",
    "tags": [
      "CGMM",
      "ETF",
      "SMID",
      "capital",
      "cgmm",
      "focused",
      "group",
      "growth",
      "small",
      "smid",
      "space"
    ]
  },
  {
    "id": "cgic-capital-group-international-core-equity-etf-core-international-with-income-awareness",
    "title": "CGIC — Capital Group International Core Equity ETF: Core International with Income Awareness",
    "published_date": "2024",
    "url": "https://www.capitalgroup.com/individual/investments/exchange-traded-funds/details/cgic",
    "summary": "CGIC is an actively managed, core international equity ETF that seeks long-term growth of capital while providing current income. The portfolio invests primarily outside the U.S. (including emerging markets) and tilts toward seasoned, dividend-paying franchises to help moderate volatility through cycles. For global allocators, CGIC can serve as a core developed-ex-U.S. sleeve with the flexibility to own emerging markets and balance growth with dividend support.",
    "tags": [
      "CGIC",
      "ETF",
      "awareness",
      "capital",
      "cgic",
      "core",
      "equity",
      "group",
      "income",
      "international",
      "with"
    ]
  },
  {
    "id": "cgui-capital-group-ultra-short-income-etf-cash-management-with-active-credit-selection",
    "title": "CGUI — Capital Group Ultra Short Income ETF: Cash Management with Active Credit Selection",
    "published_date": "2024",
    "url": "https://www.capitalgroup.com/individual/investments/exchange-traded-funds/details/cgui",
    "summary": "CGUI is an actively managed ultra-short-duration bond ETF designed for liquidity and modest income. It invests primarily in U.S. dollar-denominated, investment-grade, short-term instruments—such as commercial paper, certificates of deposit, Treasuries/Agencies, high-quality corporates, and asset-backed securities—and typically maintains a notable allocation to financials issuers consistent with the ultra-short market. For advisors, CGUI may function as an enhanced cash or “dry powder” sleeve with disciplined credit research and tight duration control.",
    "tags": [
      "CGUI",
      "ETF",
      "active",
      "capital",
      "cash",
      "cgui",
      "credit",
      "group",
      "income",
      "management",
      "selection",
      "short",
      "ultra",
      "with"
    ]
  },
  {
    "id": "cgie-capital-group-international-equity-etf-prudent-growth-with-downside-awareness",
    "title": "CGIE — Capital Group International Equity ETF: Prudent Growth with Downside Awareness",
    "published_date": "2024",
    "url": "https://www.capitalgroup.com/individual/investments/exchange-traded-funds/details/cgie",
    "summary": "CGIE is an actively managed international equity ETF seeking prudent growth of capital and conservation of principal by focusing mainly on developed-market companies with resilient balance sheets and, often, dividend discipline. The approach aims for a smoother ride across full market cycles—seeking lower downside capture—by emphasizing durable quality and fundamental valuation. As a core developed-ex-U.S. allocation, CGIE can pair with U.S. large-cap holdings to diversify earnings and policy exposure.",
    "tags": [
      "CGIE",
      "ETF",
      "awareness",
      "capital",
      "cgie",
      "downside",
      "equity",
      "group",
      "growth",
      "international",
      "prudent",
      "with"
    ]
  },
  {
    "id": "capital-group-kkr-interval-funds-public-private-access-to-broader-credit-opportunities",
    "title": "Capital Group + KKR Interval Funds: Public-Private+ Access to Broader Credit Opportunities",
    "published_date": "April 29, 2025",
    "url": "https://www.capitalgroup.com/advisor/investments/public-private-plus.html",
    "summary": "Capital Group and KKR introduced a suite of “Public-Private+” interval funds designed to blend public credit with private credit, seeking higher income and broader diversification than traditional public fixed income alone. Initial offerings include Capital Group KKR Core Plus+ and Capital Group KKR Multi-Sector+, with interval-fund structures providing periodic liquidity while enabling access to private markets through KKR’s sourcing and underwriting. This partnership extends Capital Group’s distribution into retail-friendly alternative credit and reflects the broader industry trend of hybrid vehicles bringing private assets to affluent investors.",
    "tags": [
      "KKR",
      "access",
      "broader",
      "capital",
      "credit",
      "funds",
      "group",
      "interval",
      "opportunities",
      "private",
      "public"
    ]
  }
]